/*
SQLyog Professional v12.09 (64 bit)
MySQL - 5.5.40 : Database - book_system
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`book_system` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `book_system`;

/*Table structure for table `book` */

DROP TABLE IF EXISTS `book`;

CREATE TABLE `book` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(32) DEFAULT NULL,
  `desc` varchar(200) DEFAULT NULL,
  `author` varchar(32) DEFAULT NULL,
  `price` double(4,2) DEFAULT NULL,
  `stock` int(11) DEFAULT NULL,
  KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=44 DEFAULT CHARSET=utf8;

/*Data for the table `book` */

insert  into `book`(`id`,`name`,`desc`,`author`,`price`,`stock`) values (1,'倚天屠龙记','元朝末年，群雄纷起，武陵动荡。江湖传闻，得倚天剑和屠龙刀者，可得天下，武林至尊，宝刀屠龙','金庸',66.66,8),(2,'小李飞刀','明朝中期成化年间，厌倦了官场世俗的文武全才李寻欢遇难之际被武林高手龙啸云相救，二人结为义兄弟','古龙',55.53,9),(3,'萍踪侠影录','小说精心塑造了一个以国家、民族利益为重,不计世仇,甘愿抛弃荣华富贵、奔波于塞北中原之间,屡建奇功的大侠张丹枫的生动形象','梁羽生',88.88,3),(4,'ceshi1','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(5,'ceshi2','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(6,'ceshi3','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(7,'ceshi4','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(8,'ceshi5','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(9,'ceshi6','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(10,'ceshi7','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(11,'ceshi8','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(12,'ceshi9','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(13,'ceshi10','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(14,'ceshi11','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(15,'ceshi12','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(16,'ceshi13','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(17,'ceshi14','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(18,'ceshi15','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(19,'ceshi16','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(20,'ceshi17','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(21,'ceshi18','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(22,'ceshi19','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(23,'ceshi20','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(24,'ceshi21','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(25,'ceshi22','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(26,'ceshi23','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(27,'ceshi24','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(28,'ceshi25','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(29,'ceshi26','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(30,'ceshi27','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(31,'ceshi28','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(32,'ceshi29','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(33,'ceshi30','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(34,'ceshi31','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(35,'ceshi32','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(36,'ceshi33','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(37,'ceshi34','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(38,'ceshi35','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(39,'ceshi36','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(40,'ceshi37','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(41,'ceshi38','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(42,'ceshi39','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3),(43,'ceshi40','该小说以宋末元初为历史背景，讲述了主人公梁萧由一个江湖浪子成长为一代大侠的传奇经历','凤歌',99.99,3);

/*Table structure for table `user` */

DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(32) DEFAULT NULL,
  `password` varchar(32) DEFAULT NULL,
  `phone` varchar(16) DEFAULT NULL,
  `gender` char(1) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=49 DEFAULT CHARSET=utf8;

/*Data for the table `user` */

insert  into `user`(`id`,`username`,`password`,`phone`,`gender`) values (2,'Andom','123456','13255556666','男'),(3,'James','123456','13255556666','男'),(4,'Alice','123456','13255556666','女'),(5,'Madonna','123456','13255556666','女'),(6,'ceshi1','123456','13255556666','男'),(7,'ceshi2','123456','13255556666','男'),(8,'ceshi3','123456','13255556666','男'),(9,'ceshi4','123456','13255556666','男'),(10,'ceshi5','123456','13255556666','男'),(11,'ceshi6','123456','13255556666','男'),(12,'ceshi7','123456','13255556666','男'),(13,'ceshi8','123456','13255556666','男'),(14,'ceshi9','123456','13255556666','男'),(15,'ceshi10','123456','13255556666','男'),(16,'ceshi11','123456','13255556666','男'),(17,'ceshi12','123456','13255556666','男'),(18,'ceshi13','123456','13255556666','男'),(19,'ceshi14','123456','13255556666','男'),(20,'ceshi15','123456','13255556666','男'),(21,'ceshi16','123456','13255556666','男'),(22,'ceshi17','123456','13255556666','男'),(23,'ceshi18','123456','13255556666','男'),(24,'ceshi19','123456','13255556666','男'),(25,'ceshi20','123456','13255556666','男'),(26,'ceshi21','123456','13255556666','男'),(27,'ceshi22','123456','13255556666','男'),(28,'ceshi23','123456','13255556666','男'),(29,'ceshi24','123456','13255556666','男'),(30,'ceshi25','123456','13255556666','男'),(31,'ceshi26','123456','13255556666','男'),(32,'ceshi27','123456','13255556666','男'),(33,'ceshi28','123456','13255556666','男'),(34,'ceshi29','123456','13255556666','男'),(35,'ceshi30','123456','13255556666','男'),(36,'ceshi31','123456','13255556666','男'),(37,'ceshi32','123456','13255556666','男'),(38,'ceshi33','123456','13255556666','男'),(39,'ceshi34','123456','13255556666','男'),(40,'ceshi35','123456','13255556666','男'),(41,'ceshi36','123456','13255556666','男'),(42,'ceshi37','123456','13255556666','男'),(43,'ceshi38','123456','13255556666','男'),(44,'ceshi39','123456','13255556666','男'),(45,'ceshi40','123456','13255556666','男'),(46,'ceshi41','123456','13255556666','男'),(47,'ceshi42','123456','13255556666','男'),(48,'ceshi43','123456','13255556666','男');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
